#include <stdio.h>

int main(void){

	unsigned char x = 40;
	printf("x = %d\n", x); // x = 40 двоичное представление числа 00101000
	x = x >> 1;
	printf("x = %d\n", x); // x = 20 двоичное представление числа 00010100
	x = x >> 2;
	printf("x = %d\n", x); // x = 5 двоичное представление числа 00000101

	x = x << 1;
	printf("x = %d\n", x); // x = 10 двоичное представление числа 00001010
	x = x << 2;
	printf("x = %d\n", x); // x = 40 двоичное представление числа 00101000

	unsigned char y = -128;
	printf("y = %d\n", y); // y = 128 двоичное представление числа 10000000
	y = y >> 1;
	printf("y = %d\n", y); // y = -64 двоичное представление числа 11111100

	return 0;
}
